//---------------------------------------------------------------------------

#ifndef hahaha_shape_function_roiH
#define hahaha_shape_function_roiH
//---------------------------------------------------------------------------
#pragma once
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#include <shape\hahaha_point.h>
#include <shape\hahaha_roi.h>
//---------------------------------------------------------------------------
#include <define\shape\hahaha_define_shape_rectangle_control_point.h>
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
namespace hahahalib
{
//---------------------------------------------------------------------------
class hahaha_bitmap;

//---------------------------------------------------------------------------
namespace shape
{
//---------------------------------------------------------------------------
template <typename T>
class hahaha_shape_function_roi
{

public:
    // 回傳目前狀態判斷結果。
    static bool Is_Point_In(const hahahalib::hahaha_roi<T>& roi, const hahahalib::hahaha_point<T>& point);
    // 修正Roi固定Bitmap比率
    static int Fix_Roi_Fix_Bitmap_Ratio(hahahalib::hahaha_roi<T>& roi, const hahaha_bitmap& bitmap, const double& dx, const double& dy, halib_def::shape_rectangle_control_point control_point);
public:

};
//---------------------------------------------------------------------------
} // shape
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------


//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
} // hahahalib
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
namespace halib_shape
{
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------

typedef hahahalib::shape::hahaha_shape_function_roi<int> roi;
typedef hahahalib::shape::hahaha_shape_function_roi<float> roi_float;
typedef hahahalib::shape::hahaha_shape_function_roi<double> roi_double;

//---------------------------------------------------------------------------
// 最多只能縮到這樣，不要用到H & A
//// namespace X :: f
//halib::roi roi_ = X::f::point::Center_Roi(halib::point(roi_.X1_, roi_.Y1_), Region_->Paint_Point_Size_);
//if(X::f::roi::Is_Point_In(roi_, halib::point(X, Y))
//)

//---------------------------------------------------------------------------
} // halib_shape
//---------------------------------------------------------------------------

#endif