//---------------------------------------------------------------------------

#ifndef hahaha_ui_messengeH
#define hahaha_ui_messengeH
//---------------------------------------------------------------------------
#pragma once
//---------------------------------------------------------------------------
#include <Windows.h>
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
namespace hahahalib
{
//---------------------------------------------------------------------------

class hahaha_ui_messenge
{
public:
	hahaha_ui_messenge();
	~hahaha_ui_messenge();

	hahaha_ui_messenge(const hahaha_ui_messenge& hum);
    hahaha_ui_messenge(hahaha_ui_messenge&& hum) noexcept;
	hahaha_ui_messenge& operator=(const hahaha_ui_messenge& hum);
	hahaha_ui_messenge& operator=(hahaha_ui_messenge&& hum) noexcept;
	void Copy(const hahaha_ui_messenge& hum);
    void Move(hahaha_ui_messenge&& hum) noexcept;


public:
	int Reset();

public:
public:
    int Send_Message(
        unsigned int message,       // 訊息代碼（如 WM_COMMAND, WM_USER + N）
        int command,  // 附帶參數1（整數或指標）
        void* parameter   // 附帶參數2（整數或指標）
    );

    int Post_Message(
        unsigned int message,       // 訊息代碼（如 WM_COMMAND, WM_USER + N）
        int command,  // 附帶參數1（整數或指標）
        void* parameter   // 附帶參數2（整數或指標）
    );

public:
public:
public:
    HWND Handle_;
};



//---------------------------------------------------------------------------
} // hahahalib
//---------------------------------------------------------------------------

//---------------------------------------------------------------------------
namespace halib
{
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
namespace ui
{
//---------------------------------------------------------------------------
typedef hahahalib::hahaha_ui_messenge message;



//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
} // ui
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
} // halib
//---------------------------------------------------------------------------

#endif
